# Books 
by Nokuthula Mchunu

In [2]:
import pymysql
import pandas as pd 

pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [3]:
# Create connection string using credentials following this format
# Create connection string using credentials following this format
 #connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Lwanda09" # (or whatever password you chose during mysql installation)
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [4]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [15]:
#Reading csv files 
df_user = pd.read_csv('/Users/noksmchunu/Downloads/data.csv')
df_user.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [16]:
# creating users  table 
df_user.to_sql('users', engine, if_exists = 'replace')

3

In [17]:
#Reading csv files 
df_books = pd.read_csv('/Users/noksmchunu/Downloads/data-2.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [18]:
# creating books table 
df_books.to_sql('books', engine, if_exists = 'replace')

6

In [19]:
#Reading csv files 
df_authors = pd.read_csv('/Users/noksmchunu/Downloads/data-3.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [20]:
# creating authors table 
df_authors.to_sql('authors', engine, if_exists = 'replace')

5

In [21]:
#Reading csv files 
df_favourates = pd.read_csv('/Users/noksmchunu/Downloads/data-4.csv')
df_favourates.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [22]:
# creating favourate table 
df_favourates.to_sql('favourates', engine, if_exists = 'replace')

7

In [36]:
q = """ SELECT title, favourates.user_id
FROM books.books
JOIN books.favourates ON books.id = favourates.book_id
WHERE favourates.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));

;"""

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1